
# Auto-generated by Interface Designer
#
# WARNING: Any manual changes made to this file will be lost when generating constraints.

# Efinity Interface Designer SDC
# Version: 2025.2.288
# Date: 2026-06-27 14:07

# Copyright (C) 2013 - 2025 Efinix Inc. All rights reserved.

# Device: T35F324
# Project: mem_test
# Timing Model: C4 (final)

# PLL Constraints
###################
create_clock -period 2.506 -name Axi0Clk [get_ports {Axi0Clk}]
create_clock -period 37.594 -name clk_cmos [get_ports {clk_cmos}]
create_clock -period 10.417 -name Axi0Clk [get_ports {Axi0Clk}]
create_clock -period 20.833 -name tx_slowclk [get_ports {tx_slowclk}]
create_clock -waveform {1.488 4.464} -period 5.952 -name tx_fastclk [get_ports {tx_fastclk}]
create_clock -period 39.683 -name hdmi_clk1x_i [get_ports {hdmi_clk1x_i}]
create_clock -period 19.841 -name hdmi_clk2x_i [get_ports {hdmi_clk2x_i}]
create_clock -waveform {1.984 5.953} -period 7.937 -name hdmi_clk5x_i [get_ports {hdmi_clk5x_i}]
create_clock -period 50.000 -name mipi_clkesc_i [get_ports {mipi_clkesc_i}]
create_clock -period 10.000 -name mipi_clkcal_i [get_ports {mipi_clkcal_i}]
create_clock -period 10.000 -name mipi_pixclk_i [get_ports {mipi_pixclk_i}]

# GPIO Constraints
####################
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {led_data[0]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {led_data[0]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {led_data[1]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {led_data[1]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {led_data[2]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {led_data[2]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {led_data[3]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {led_data[3]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {led_data[4]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {led_data[4]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {led_data[5]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {led_data[5]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {led_data[6]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {led_data[6]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {led_data[7]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {led_data[7]}]

# LVDS RX GPIO Constraints
############################
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {uart_rxd}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {uart_rxd}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {mipi_trig_o[0]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {mipi_trig_o[0]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {mipi_trig_o[1]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {mipi_trig_o[1]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {uart_txd}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {uart_txd}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {mipi0_scl_i}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {mipi0_scl_i}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {mipi0_scl_o}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {mipi0_scl_o}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {mipi0_scl_oe}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {mipi0_scl_oe}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {mipi0_sda_i}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {mipi0_sda_i}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {mipi0_sda_o}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {mipi0_sda_o}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {mipi0_sda_oe}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {mipi0_sda_oe}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {mipi1_scl_i}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {mipi1_scl_i}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {mipi1_scl_o}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {mipi1_scl_o}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {mipi1_scl_oe}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {mipi1_scl_oe}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {mipi1_sda_i}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {mipi1_sda_i}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {mipi1_sda_o}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {mipi1_sda_o}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {mipi1_sda_oe}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {mipi1_sda_oe}]

# LVDS Tx Constraints
#######################
set_output_delay -clock hdmi_clk2x_i -reference_pin [get_ports {hdmi_clk2x_i~CLKOUT~55~1}] -max 0.080 [get_ports {hdmi_tx0_o[*]}]
set_output_delay -clock hdmi_clk2x_i -reference_pin [get_ports {hdmi_clk2x_i~CLKOUT~55~1}] -min -0.080 [get_ports {hdmi_tx0_o[*]}]
set_output_delay -clock hdmi_clk2x_i -reference_pin [get_ports {hdmi_clk2x_i~CLKOUT~49~1}] -max 0.080 [get_ports {hdmi_tx1_o[*]}]
set_output_delay -clock hdmi_clk2x_i -reference_pin [get_ports {hdmi_clk2x_i~CLKOUT~49~1}] -min -0.080 [get_ports {hdmi_tx1_o[*]}]
set_output_delay -clock hdmi_clk2x_i -reference_pin [get_ports {hdmi_clk2x_i~CLKOUT~43~1}] -max 0.080 [get_ports {hdmi_tx2_o[*]}]
set_output_delay -clock hdmi_clk2x_i -reference_pin [get_ports {hdmi_clk2x_i~CLKOUT~43~1}] -min -0.080 [get_ports {hdmi_tx2_o[*]}]
set_output_delay -clock hdmi_clk2x_i -reference_pin [get_ports {hdmi_clk2x_i~CLKOUT~61~1}] -max 0.080 [get_ports {hdmi_txc_o[*]}]
set_output_delay -clock hdmi_clk2x_i -reference_pin [get_ports {hdmi_clk2x_i~CLKOUT~61~1}] -min -0.080 [get_ports {hdmi_txc_o[*]}]

# MIPI RX Constraints
#######################
set_output_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~421}] -max 0.564 [get_ports {mipi_rx_0_VC_ENA_o[*]}]
set_output_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~421}] -min -0.069 [get_ports {mipi_rx_0_VC_ENA_o[*]}]
set_output_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~421}] -max 0.113 [get_ports {mipi_rx_0_CLEAR}]
set_output_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~421}] -min -0.157 [get_ports {mipi_rx_0_CLEAR}]
set_input_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~421}] -max 1.084 [get_ports {mipi_rx_0_VSYNC_i[*]}]
set_input_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~421}] -min 0.542 [get_ports {mipi_rx_0_VSYNC_i[*]}]
set_input_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~421}] -max 1.078 [get_ports {mipi_rx_0_HSYNC_i[*]}]
set_input_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~421}] -min 0.539 [get_ports {mipi_rx_0_HSYNC_i[*]}]
set_input_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~421}] -max 0.932 [get_ports {mipi_rx_0_VALID_i}]
set_input_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~421}] -min 0.466 [get_ports {mipi_rx_0_VALID_i}]
set_input_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~421}] -max 1.002 [get_ports {mipi_rx_0_CNT_i[*]}]
set_input_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~421}] -min 0.501 [get_ports {mipi_rx_0_CNT_i[*]}]
set_input_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~421}] -max 1.030 [get_ports {mipi_rx_0_DATA_i[*]}]
set_input_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~421}] -min 0.515 [get_ports {mipi_rx_0_DATA_i[*]}]
set_input_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~421}] -max 0.947 [get_ports {mipi_rx_0_ERROR[*]}]
set_input_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~421}] -min 0.474 [get_ports {mipi_rx_0_ERROR[*]}]
set_input_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~421}] -max 0.945 [get_ports {mipi_rx_0_ULPS_CLK}]
set_input_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~421}] -min 0.473 [get_ports {mipi_rx_0_ULPS_CLK}]
set_input_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~421}] -max 0.954 [get_ports {mipi_rx_0_ULPS[*]}]
set_input_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~421}] -min 0.477 [get_ports {mipi_rx_0_ULPS[*]}]
set_output_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~330}] -max 0.564 [get_ports {mipi_rx_1_VC_ENA_o[*]}]
set_output_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~330}] -min -0.069 [get_ports {mipi_rx_1_VC_ENA_o[*]}]
set_output_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~330}] -max 0.113 [get_ports {mipi_rx_1_CLEAR}]
set_output_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~330}] -min -0.157 [get_ports {mipi_rx_1_CLEAR}]
set_input_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~330}] -max 1.084 [get_ports {mipi_rx_1_VSYNC_i[*]}]
set_input_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~330}] -min 0.542 [get_ports {mipi_rx_1_VSYNC_i[*]}]
set_input_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~330}] -max 1.078 [get_ports {mipi_rx_1_HSYNC_i[*]}]
set_input_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~330}] -min 0.539 [get_ports {mipi_rx_1_HSYNC_i[*]}]
set_input_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~330}] -max 0.932 [get_ports {mipi_rx_1_VALID_i}]
set_input_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~330}] -min 0.466 [get_ports {mipi_rx_1_VALID_i}]
set_input_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~330}] -max 1.002 [get_ports {mipi_rx_1_CNT_i[*]}]
set_input_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~330}] -min 0.501 [get_ports {mipi_rx_1_CNT_i[*]}]
set_input_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~330}] -max 1.030 [get_ports {mipi_rx_1_DATA_i[*]}]
set_input_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~330}] -min 0.515 [get_ports {mipi_rx_1_DATA_i[*]}]
set_input_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~330}] -max 0.947 [get_ports {mipi_rx_1_ERROR[*]}]
set_input_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~330}] -min 0.474 [get_ports {mipi_rx_1_ERROR[*]}]
set_input_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~330}] -max 0.945 [get_ports {mipi_rx_1_ULPS_CLK}]
set_input_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~330}] -min 0.473 [get_ports {mipi_rx_1_ULPS_CLK}]
set_input_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~330}] -max 0.954 [get_ports {mipi_rx_1_ULPS[*]}]
set_input_delay -clock mipi_pixclk_i -reference_pin [get_ports {mipi_pixclk_i~CLKOUT~129~330}] -min 0.477 [get_ports {mipi_rx_1_ULPS[*]}]

# DDR Constraints
###################
set_output_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -max 2.500 [get_ports {DdrCtrl_AADDR_0[*]}]
set_output_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -min -0.400 [get_ports {DdrCtrl_AADDR_0[*]}]
set_output_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -max 2.500 [get_ports {DdrCtrl_ABURST_0[*]}]
set_output_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -min -0.400 [get_ports {DdrCtrl_ABURST_0[*]}]
set_output_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -max 2.500 [get_ports {DdrCtrl_AID_0[*]}]
set_output_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -min -0.400 [get_ports {DdrCtrl_AID_0[*]}]
set_output_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -max 2.500 [get_ports {DdrCtrl_ALEN_0[*]}]
set_output_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -min -0.400 [get_ports {DdrCtrl_ALEN_0[*]}]
set_output_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -max 2.500 [get_ports {DdrCtrl_ALOCK_0[*]}]
set_output_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -min -0.400 [get_ports {DdrCtrl_ALOCK_0[*]}]
set_output_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -max 2.500 [get_ports {DdrCtrl_ASIZE_0[*]}]
set_output_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -min -0.400 [get_ports {DdrCtrl_ASIZE_0[*]}]
set_output_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -max 2.500 [get_ports {DdrCtrl_ATYPE_0}]
set_output_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -min -0.400 [get_ports {DdrCtrl_ATYPE_0}]
set_output_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -max 2.500 [get_ports {DdrCtrl_AVALID_0}]
set_output_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -min -0.400 [get_ports {DdrCtrl_AVALID_0}]
set_output_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -max 2.500 [get_ports {DdrCtrl_BREADY_0}]
set_output_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -min -0.400 [get_ports {DdrCtrl_BREADY_0}]
set_output_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -max 2.500 [get_ports {DdrCtrl_RREADY_0}]
set_output_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -min -0.400 [get_ports {DdrCtrl_RREADY_0}]
set_output_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -max 2.500 [get_ports {DdrCtrl_WDATA_0[*]}]
set_output_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -min -0.400 [get_ports {DdrCtrl_WDATA_0[*]}]
set_output_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -max 2.500 [get_ports {DdrCtrl_WID_0[*]}]
set_output_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -min -0.400 [get_ports {DdrCtrl_WID_0[*]}]
set_output_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -max 2.500 [get_ports {DdrCtrl_WLAST_0}]
set_output_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -min -0.400 [get_ports {DdrCtrl_WLAST_0}]
set_output_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -max 2.500 [get_ports {DdrCtrl_WSTRB_0[*]}]
set_output_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -min -0.400 [get_ports {DdrCtrl_WSTRB_0[*]}]
set_output_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -max 2.500 [get_ports {DdrCtrl_WVALID_0}]
set_output_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -min -0.400 [get_ports {DdrCtrl_WVALID_0}]
set_input_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -max 3.000 [get_ports {DdrCtrl_AREADY_0}]
set_input_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -min 1.500 [get_ports {DdrCtrl_AREADY_0}]
set_input_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -max 3.000 [get_ports {DdrCtrl_BID_0[*]}]
set_input_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -min 1.500 [get_ports {DdrCtrl_BID_0[*]}]
set_input_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -max 3.000 [get_ports {DdrCtrl_BVALID_0}]
set_input_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -min 1.500 [get_ports {DdrCtrl_BVALID_0}]
set_input_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -max 3.000 [get_ports {DdrCtrl_RDATA_0[*]}]
set_input_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -min 1.500 [get_ports {DdrCtrl_RDATA_0[*]}]
set_input_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -max 3.000 [get_ports {DdrCtrl_RID_0[*]}]
set_input_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -min 1.500 [get_ports {DdrCtrl_RID_0[*]}]
set_input_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -max 3.000 [get_ports {DdrCtrl_RLAST_0}]
set_input_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -min 1.500 [get_ports {DdrCtrl_RLAST_0}]
set_input_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -max 3.000 [get_ports {DdrCtrl_RRESP_0[*]}]
set_input_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -min 1.500 [get_ports {DdrCtrl_RRESP_0[*]}]
set_input_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -max 3.000 [get_ports {DdrCtrl_RVALID_0}]
set_input_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -min 1.500 [get_ports {DdrCtrl_RVALID_0}]
set_input_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -max 3.000 [get_ports {DdrCtrl_WREADY_0}]
set_input_delay -clock Axi0Clk -reference_pin [get_ports {Axi0Clk~CLKOUT~129~28}] -min 1.500 [get_ports {DdrCtrl_WREADY_0}]
